benchmark-results/baseline-go-post-heavy.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: benchmarks/post-heavy.js
        output: -

     scenarios: (100.00%) 1 scenario, 250 max VUs, 2m40s max duration (incl. graceful stop):
              * default: Up to 250 looping VUs for 2m10s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 002/250 VUs, 26 complete and 0 interrupted iterations
default   [   1% ] 002/250 VUs  0m01.0s/2m10.0s

running (0m02.0s), 004/250 VUs, 87 complete and 0 interrupted iterations
default   [   2% ] 004/250 VUs  0m02.0s/2m10.0s

running (0m03.0s), 006/250 VUs, 183 complete and 0 interrupted iterations
default   [   2% ] 006/250 VUs  0m03.0s/2m10.0s

running (0m04.0s), 008/250 VUs, 314 complete and 0 interrupted iterations
default   [   3% ] 008/250 VUs  0m04.0s/2m10.0s

running (0m05.0s), 010/250 VUs, 480 complete and 0 interrupted iterations
default   [   4% ] 010/250 VUs  0m05.0s/2m10.0s

running (0m06.0s), 012/250 VUs, 681 complete and 0 interrupted iterations
default   [   5% ] 012/250 VUs  0m06.0s/2m10.0s

running (0m07.0s), 014/250 VUs, 917 complete and 0 interrupted iterations
default   [   5% ] 014/250 VUs  0m07.0s/2m10.0s

running (0m08.0s), 016/250 VUs, 1190 complete and 0 interrupted iterations
default   [   6% ] 016/250 VUs  0m08.0s/2m10.0s

running (0m09.0s), 018/250 VUs, 1495 complete and 0 interrupted iterations
default   [   7% ] 018/250 VUs  0m09.0s/2m10.0s

running (0m10.0s), 019/250 VUs, 1838 complete and 0 interrupted iterations
default   [   8% ] 019/250 VUs  0m10.0s/2m10.0s

running (0m11.0s), 022/250 VUs, 2223 complete and 0 interrupted iterations
default   [   8% ] 022/250 VUs  0m11.0s/2m10.0s

running (0m12.0s), 025/250 VUs, 2661 complete and 0 interrupted iterations
default   [   9% ] 025/250 VUs  0m12.0s/2m10.0s

running (0m13.0s), 028/250 VUs, 3164 complete and 0 interrupted iterations
default   [  10% ] 028/250 VUs  0m13.0s/2m10.0s

running (0m14.0s), 031/250 VUs, 3713 complete and 0 interrupted iterations
default   [  11% ] 031/250 VUs  0m14.0s/2m10.0s

running (0m15.0s), 034/250 VUs, 4225 complete and 0 interrupted iterations
default   [  12% ] 034/250 VUs  0m15.0s/2m10.0s

running (0m16.0s), 037/250 VUs, 4871 complete and 0 interrupted iterations
default   [  12% ] 037/250 VUs  0m16.0s/2m10.0s

running (0m17.0s), 040/250 VUs, 5575 complete and 0 interrupted iterations
default   [  13% ] 040/250 VUs  0m17.0s/2m10.0s

running (0m18.0s), 043/250 VUs, 6365 complete and 0 interrupted iterations
default   [  14% ] 043/250 VUs  0m18.0s/2m10.0s

running (0m19.0s), 046/250 VUs, 7180 complete and 0 interrupted iterations
default   [  15% ] 046/250 VUs  0m19.0s/2m10.0s

running (0m20.0s), 049/250 VUs, 8077 complete and 0 interrupted iterations
default   [  15% ] 049/250 VUs  0m20.0s/2m10.0s

running (0m21.0s), 052/250 VUs, 9005 complete and 0 interrupted iterations
default   [  16% ] 052/250 VUs  0m21.0s/2m10.0s

running (0m22.0s), 055/250 VUs, 10013 complete and 0 interrupted iterations
default   [  17% ] 055/250 VUs  0m22.0s/2m10.0s

running (0m23.0s), 058/250 VUs, 11053 complete and 0 interrupted iterations
default   [  18% ] 058/250 VUs  0m23.0s/2m10.0s

running (0m24.0s), 061/250 VUs, 12146 complete and 0 interrupted iterations
default   [  18% ] 061/250 VUs  0m24.0s/2m10.0s

running (0m25.0s), 064/250 VUs, 13270 complete and 0 interrupted iterations
default   [  19% ] 064/250 VUs  0m25.0s/2m10.0s

running (0m26.0s), 067/250 VUs, 14457 complete and 0 interrupted iterations
default   [  20% ] 067/250 VUs  0m26.0s/2m10.0s

running (0m27.0s), 070/250 VUs, 15695 complete and 0 interrupted iterations
default   [  21% ] 070/250 VUs  0m27.0s/2m10.0s

running (0m28.0s), 073/250 VUs, 17018 complete and 0 interrupted iterations
default   [  22% ] 073/250 VUs  0m28.0s/2m10.0s

running (0m29.0s), 076/250 VUs, 18409 complete and 0 interrupted iterations
default   [  22% ] 076/250 VUs  0m29.0s/2m10.0s

running (0m30.0s), 079/250 VUs, 19768 complete and 0 interrupted iterations
default   [  23% ] 079/250 VUs  0m30.0s/2m10.0s

running (0m31.0s), 081/250 VUs, 21284 complete and 0 interrupted iterations
default   [  24% ] 081/250 VUs  0m31.0s/2m10.0s

running (0m32.0s), 083/250 VUs, 22770 complete and 0 interrupted iterations
default   [  25% ] 083/250 VUs  0m32.0s/2m10.0s

running (0m33.0s), 085/250 VUs, 24283 complete and 0 interrupted iterations
default   [  25% ] 085/250 VUs  0m33.0s/2m10.0s

running (0m34.0s), 086/250 VUs, 25743 complete and 0 interrupted iterations
default   [  26% ] 086/250 VUs  0m34.0s/2m10.0s

running (0m35.0s), 088/250 VUs, 27316 complete and 0 interrupted iterations
default   [  27% ] 088/250 VUs  0m35.0s/2m10.0s

running (0m36.0s), 090/250 VUs, 28924 complete and 0 interrupted iterations
default   [  28% ] 090/250 VUs  0m36.0s/2m10.0s

running (0m37.0s), 092/250 VUs, 30620 complete and 0 interrupted iterations
default   [  28% ] 092/250 VUs  0m37.0s/2m10.0s

running (0m38.0s), 093/250 VUs, 32128 complete and 0 interrupted iterations
default   [  29% ] 093/250 VUs  0m38.0s/2m10.0s

running (0m39.0s), 095/250 VUs, 33828 complete and 0 interrupted iterations
default   [  30% ] 095/250 VUs  0m39.0s/2m10.0s

running (0m40.0s), 097/250 VUs, 35600 complete and 0 interrupted iterations
default   [  31% ] 097/250 VUs  0m40.0s/2m10.0s

running (0m41.0s), 099/250 VUs, 37391 complete and 0 interrupted iterations
default   [  32% ] 099/250 VUs  0m41.0s/2m10.0s

running (0m42.0s), 100/250 VUs, 39078 complete and 0 interrupted iterations
default   [  32% ] 100/250 VUs  0m42.0s/2m10.0s

running (0m43.0s), 102/250 VUs, 40907 complete and 0 interrupted iterations
default   [  33% ] 102/250 VUs  0m43.0s/2m10.0s

running (0m44.0s), 104/250 VUs, 42808 complete and 0 interrupted iterations
default   [  34% ] 104/250 VUs  0m44.0s/2m10.0s

running (0m45.0s), 106/250 VUs, 44685 complete and 0 interrupted iterations
default   [  35% ] 106/250 VUs  0m45.0s/2m10.0s

running (0m46.0s), 107/250 VUs, 46659 complete and 0 interrupted iterations
default   [  35% ] 107/250 VUs  0m46.0s/2m10.0s

running (0m47.0s), 109/250 VUs, 48428 complete and 0 interrupted iterations
default   [  36% ] 109/250 VUs  0m47.0s/2m10.0s

running (0m48.0s), 111/250 VUs, 50103 complete and 0 interrupted iterations
default   [  37% ] 111/250 VUs  0m48.0s/2m10.0s

running (0m49.0s), 113/250 VUs, 52107 complete and 0 interrupted iterations
default   [  38% ] 113/250 VUs  0m49.0s/2m10.0s

running (0m50.0s), 114/250 VUs, 54192 complete and 0 interrupted iterations
default   [  38% ] 114/250 VUs  0m50.0s/2m10.0s

running (0m51.0s), 116/250 VUs, 56105 complete and 0 interrupted iterations
default   [  39% ] 116/250 VUs  0m51.0s/2m10.0s

running (0m52.0s), 118/250 VUs, 58085 complete and 0 interrupted iterations
default   [  40% ] 118/250 VUs  0m52.0s/2m10.0s

running (0m53.0s), 120/250 VUs, 60066 complete and 0 interrupted iterations
default   [  41% ] 120/250 VUs  0m53.0s/2m10.0s

running (0m54.0s), 121/250 VUs, 61935 complete and 0 interrupted iterations
default   [  42% ] 121/250 VUs  0m54.0s/2m10.0s

running (0m55.0s), 123/250 VUs, 63939 complete and 0 interrupted iterations
default   [  42% ] 123/250 VUs  0m55.0s/2m10.0s

running (0m56.0s), 125/250 VUs, 65925 complete and 0 interrupted iterations
default   [  43% ] 125/250 VUs  0m56.0s/2m10.0s

running (0m57.0s), 127/250 VUs, 67475 complete and 0 interrupted iterations
default   [  44% ] 127/250 VUs  0m57.0s/2m10.0s

running (0m58.0s), 128/250 VUs, 69341 complete and 0 interrupted iterations
default   [  45% ] 128/250 VUs  0m58.0s/2m10.0s

running (0m59.0s), 130/250 VUs, 71344 complete and 0 interrupted iterations
default   [  45% ] 130/250 VUs  0m59.0s/2m10.0s

running (1m00.0s), 132/250 VUs, 73104 complete and 0 interrupted iterations
default   [  46% ] 132/250 VUs  1m00.0s/2m10.0s

running (1m01.0s), 134/250 VUs, 74713 complete and 0 interrupted iterations
default   [  47% ] 134/250 VUs  1m01.0s/2m10.0s

running (1m02.0s), 135/250 VUs, 76280 complete and 0 interrupted iterations
default   [  48% ] 135/250 VUs  1m02.0s/2m10.0s

running (1m03.0s), 137/250 VUs, 77860 complete and 0 interrupted iterations
default   [  48% ] 137/250 VUs  1m03.0s/2m10.0s

running (1m04.0s), 139/250 VUs, 79388 complete and 0 interrupted iterations
default   [  49% ] 139/250 VUs  1m04.0s/2m10.0s

running (1m05.0s), 141/250 VUs, 80728 complete and 0 interrupted iterations
default   [  50% ] 141/250 VUs  1m05.0s/2m10.0s

running (1m06.0s), 142/250 VUs, 82039 complete and 0 interrupted iterations
default   [  51% ] 142/250 VUs  1m06.0s/2m10.0s

running (1m07.0s), 144/250 VUs, 83277 complete and 0 interrupted iterations
default   [  52% ] 144/250 VUs  1m07.0s/2m10.0s

running (1m08.0s), 146/250 VUs, 84577 complete and 0 interrupted iterations
default   [  52% ] 146/250 VUs  1m08.0s/2m10.0s

running (1m09.0s), 148/250 VUs, 85773 complete and 0 interrupted iterations
default   [  53% ] 148/250 VUs  1m09.0s/2m10.0s

running (1m10.0s), 149/250 VUs, 86834 complete and 0 interrupted iterations
default   [  54% ] 149/250 VUs  1m10.0s/2m10.0s

running (1m11.0s), 152/250 VUs, 88186 complete and 0 interrupted iterations
default   [  55% ] 152/250 VUs  1m11.0s/2m10.0s

running (1m12.0s), 154/250 VUs, 89241 complete and 0 interrupted iterations
default   [  55% ] 154/250 VUs  1m12.0s/2m10.0s

running (1m13.0s), 157/250 VUs, 90158 complete and 0 interrupted iterations
default   [  56% ] 157/250 VUs  1m13.0s/2m10.0s

running (1m14.0s), 159/250 VUs, 91415 complete and 0 interrupted iterations
default   [  57% ] 159/250 VUs  1m14.0s/2m10.0s

running (1m15.0s), 162/250 VUs, 92507 complete and 0 interrupted iterations
default   [  58% ] 162/250 VUs  1m15.0s/2m10.0s

running (1m16.0s), 164/250 VUs, 93403 complete and 0 interrupted iterations
default   [  58% ] 164/250 VUs  1m16.0s/2m10.0s

running (1m17.0s), 167/250 VUs, 94554 complete and 0 interrupted iterations
default   [  59% ] 167/250 VUs  1m17.0s/2m10.0s

running (1m18.0s), 169/250 VUs, 95394 complete and 0 interrupted iterations
default   [  60% ] 169/250 VUs  1m18.0s/2m10.0s

running (1m19.0s), 172/250 VUs, 96265 complete and 0 interrupted iterations
default   [  61% ] 172/250 VUs  1m19.0s/2m10.0s

running (1m20.0s), 174/250 VUs, 97297 complete and 0 interrupted iterations
default   [  62% ] 174/250 VUs  1m20.0s/2m10.0s

running (1m21.0s), 177/250 VUs, 98301 complete and 0 interrupted iterations
default   [  62% ] 177/250 VUs  1m21.0s/2m10.0s

running (1m22.0s), 179/250 VUs, 99186 complete and 0 interrupted iterations
default   [  63% ] 179/250 VUs  1m22.0s/2m10.0s

running (1m23.0s), 182/250 VUs, 99894 complete and 0 interrupted iterations
default   [  64% ] 182/250 VUs  1m23.0s/2m10.0s

running (1m24.0s), 184/250 VUs, 100827 complete and 0 interrupted iterations
default   [  65% ] 184/250 VUs  1m24.0s/2m10.0s

running (1m25.0s), 187/250 VUs, 101935 complete and 0 interrupted iterations
default   [  65% ] 187/250 VUs  1m25.0s/2m10.0s

running (1m26.0s), 189/250 VUs, 102593 complete and 0 interrupted iterations
default   [  66% ] 189/250 VUs  1m26.0s/2m10.0s

running (1m27.0s), 192/250 VUs, 103315 complete and 0 interrupted iterations
default   [  67% ] 192/250 VUs  1m27.0s/2m10.0s

running (1m28.0s), 194/250 VUs, 104234 complete and 0 interrupted iterations
default   [  68% ] 194/250 VUs  1m28.0s/2m10.0s

running (1m29.0s), 197/250 VUs, 105230 complete and 0 interrupted iterations
default   [  68% ] 197/250 VUs  1m29.0s/2m10.0s

running (1m30.0s), 199/250 VUs, 106010 complete and 0 interrupted iterations
default   [  69% ] 199/250 VUs  1m30.0s/2m10.0s

running (1m31.0s), 202/250 VUs, 107015 complete and 0 interrupted iterations
default   [  70% ] 202/250 VUs  1m31.0s/2m10.0s

running (1m32.0s), 204/250 VUs, 107466 complete and 0 interrupted iterations
default   [  71% ] 204/250 VUs  1m32.0s/2m10.0s

running (1m33.0s), 207/250 VUs, 108273 complete and 0 interrupted iterations
default   [  72% ] 207/250 VUs  1m33.0s/2m10.0s

running (1m34.0s), 209/250 VUs, 109401 complete and 0 interrupted iterations
default   [  72% ] 209/250 VUs  1m34.0s/2m10.0s

running (1m35.0s), 212/250 VUs, 109981 complete and 0 interrupted iterations
default   [  73% ] 212/250 VUs  1m35.0s/2m10.0s

running (1m36.0s), 214/250 VUs, 110803 complete and 0 interrupted iterations
default   [  74% ] 214/250 VUs  1m36.0s/2m10.0s

running (1m37.0s), 217/250 VUs, 111608 complete and 0 interrupted iterations
default   [  75% ] 217/250 VUs  1m37.0s/2m10.0s

running (1m38.0s), 219/250 VUs, 112058 complete and 0 interrupted iterations
default   [  75% ] 219/250 VUs  1m38.0s/2m10.0s

running (1m39.0s), 222/250 VUs, 112760 complete and 0 interrupted iterations
default   [  76% ] 222/250 VUs  1m39.0s/2m10.0s

running (1m40.0s), 224/250 VUs, 114052 complete and 0 interrupted iterations
default   [  77% ] 224/250 VUs  1m40.0s/2m10.0s

running (1m41.0s), 227/250 VUs, 114504 complete and 0 interrupted iterations
default   [  78% ] 227/250 VUs  1m41.0s/2m10.0s

running (1m42.0s), 229/250 VUs, 115226 complete and 0 interrupted iterations
default   [  78% ] 229/250 VUs  1m42.0s/2m10.0s

running (1m43.0s), 232/250 VUs, 115920 complete and 0 interrupted iterations
default   [  79% ] 232/250 VUs  1m43.0s/2m10.0s

running (1m44.0s), 234/250 VUs, 116371 complete and 0 interrupted iterations
default   [  80% ] 234/250 VUs  1m44.0s/2m10.0s

running (1m45.0s), 237/250 VUs, 116846 complete and 0 interrupted iterations
default   [  81% ] 237/250 VUs  1m45.0s/2m10.0s

running (1m46.0s), 239/250 VUs, 117793 complete and 0 interrupted iterations
default   [  82% ] 239/250 VUs  1m46.0s/2m10.0s

running (1m47.0s), 242/250 VUs, 118766 complete and 0 interrupted iterations
default   [  82% ] 242/250 VUs  1m47.0s/2m10.0s

running (1m48.0s), 244/250 VUs, 119242 complete and 0 interrupted iterations
default   [  83% ] 244/250 VUs  1m48.0s/2m10.0s

running (1m49.0s), 247/250 VUs, 119974 complete and 0 interrupted iterations
default   [  84% ] 247/250 VUs  1m49.0s/2m10.0s

running (1m50.0s), 249/250 VUs, 120740 complete and 0 interrupted iterations
default   [  85% ] 249/250 VUs  1m50.0s/2m10.0s

running (1m51.0s), 240/250 VUs, 121191 complete and 0 interrupted iterations
default   [  85% ] 240/250 VUs  1m51.0s/2m10.0s

running (1m52.0s), 227/250 VUs, 121676 complete and 0 interrupted iterations
default   [  86% ] 227/250 VUs  1m52.0s/2m10.0s

running (1m53.0s), 216/250 VUs, 122359 complete and 0 interrupted iterations
default   [  87% ] 216/250 VUs  1m53.0s/2m10.0s

running (1m54.0s), 201/250 VUs, 123431 complete and 0 interrupted iterations
default   [  88% ] 201/250 VUs  1m54.0s/2m10.0s

running (1m55.0s), 191/250 VUs, 123968 complete and 0 interrupted iterations
default   [  88% ] 191/250 VUs  1m55.0s/2m10.0s

running (1m56.0s), 179/250 VUs, 124626 complete and 0 interrupted iterations
default   [  89% ] 179/250 VUs  1m56.0s/2m10.0s

running (1m57.0s), 164/250 VUs, 125301 complete and 0 interrupted iterations
default   [  90% ] 164/250 VUs  1m57.0s/2m10.0s

running (1m58.0s), 151/250 VUs, 126316 complete and 0 interrupted iterations
default   [  91% ] 151/250 VUs  1m58.0s/2m10.0s

running (1m59.0s), 139/250 VUs, 127799 complete and 0 interrupted iterations
default   [  92% ] 139/250 VUs  1m59.0s/2m10.0s

running (2m00.0s), 126/250 VUs, 129035 complete and 0 interrupted iterations
default   [  92% ] 126/250 VUs  2m00.0s/2m10.0s

running (2m01.0s), 114/250 VUs, 130570 complete and 0 interrupted iterations
default   [  93% ] 114/250 VUs  2m01.0s/2m10.0s

running (2m02.0s), 101/250 VUs, 131848 complete and 0 interrupted iterations
default   [  94% ] 101/250 VUs  2m02.0s/2m10.0s

running (2m03.0s), 089/250 VUs, 133133 complete and 0 interrupted iterations
default   [  95% ] 089/250 VUs  2m03.0s/2m10.0s

running (2m04.0s), 076/250 VUs, 134454 complete and 0 interrupted iterations
default   [  95% ] 076/250 VUs  2m04.0s/2m10.0s

running (2m05.0s), 064/250 VUs, 135566 complete and 0 interrupted iterations
default   [  96% ] 064/250 VUs  2m05.0s/2m10.0s

running (2m06.0s), 051/250 VUs, 136569 complete and 0 interrupted iterations
default   [  97% ] 051/250 VUs  2m06.0s/2m10.0s

running (2m07.0s), 039/250 VUs, 137382 complete and 0 interrupted iterations
default   [  98% ] 039/250 VUs  2m07.0s/2m10.0s

running (2m08.0s), 026/250 VUs, 137979 complete and 0 interrupted iterations
default   [  98% ] 026/250 VUs  2m08.0s/2m10.0s

running (2m09.0s), 013/250 VUs, 138358 complete and 0 interrupted iterations
default   [  99% ] 013/250 VUs  2m09.0s/2m10.0s

running (2m10.0s), 001/250 VUs, 138496 complete and 0 interrupted iterations
default   [ 100% ] 001/250 VUs  2m10.0s/2m10.0s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 284048  2184.122035/s
    checks_succeeded...: 100.00% 284048 out of 284048
    checks_failed......: 0.00%   0 out of 284048

    ✓ create 201
    ✓ get 200
    ✓ count 200

    HTTP
    http_req_duration..............: avg=32.33ms  min=143.81µs med=3.61ms  max=746.45ms p(90)=105.05ms p(95)=156.57ms p(99)=343.3ms 
      { expected_response:true }...: avg=32.33ms  min=143.81µs med=3.61ms  max=746.45ms p(90)=105.05ms p(95)=156.57ms p(99)=343.3ms 
    http_req_failed................: 0.00%  0 out of 284048
    http_reqs......................: 284048 2184.122035/s

    EXECUTION
    iteration_duration.............: avg=116.84ms min=51.96ms  med=59.13ms max=1.28s    p(90)=290.11ms p(95)=316.26ms p(99)=505.45ms
    iterations.....................: 138498 1064.948648/s
    vus............................: 1      min=1           max=249
    vus_max........................: 250    min=250         max=250

    NETWORK
    data_received..................: 65 MB  502 kB/s
    data_sent......................: 48 MB  366 kB/s



running (2m10.1s), 000/250 VUs, 138498 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/250 VUs  2m10s